[
    {
      "id": 1,
      "recipe_name": "Spaghetti Carbonara",
      "ingredients": [
        "1.spaghetti",
        "2.egg yolks",
        "3.guanciale or pancetta",
        "4.black pepper",
        "5.pecorino romano cheese"
      ],
      "cooking_method": "1. Cook spaghetti according to package instructions. \n2. While spaghetti is cooking, sauté guanciale or pancetta in a pan until crispy. \n3. Beat egg yolks, pecorino romano cheese, and black pepper in a bowl. \n4. When spaghetti is done, drain it and reserve some of the pasta water. \n5. Add spaghetti to the pan with the guanciale or pancetta and toss to combine. \n6. Remove pan from heat and add the egg yolk mixture, stirring quickly to coat the spaghetti. \n7. If the sauce is too thick, add some reserved pasta water to thin it out.",
      "rating": 4.4,
      "image_link": "https://www.recipetineats.com/wp-content/uploads/2022/10/Crispy-Eggplant_900px.jpg?resize=206,206"
    },
    {
      "id": 2,
      "recipe_name": "Margherita Pizza",
      "ingredients": [
        "1.pizza dough",
        "2.tomato sauce",
        "3.fresh mozzarella cheese",
        "4.fresh basil",
        "5.olive oil"
      ],
      "cooking_method": "1. Preheat oven to 500°F (260°C). \n2. Roll out pizza dough to desired thickness. \n3. Spread tomato sauce evenly over dough, leaving a small border around the edge. \n4. Tear fresh mozzarella into small pieces and scatter over sauce. \n5. Place fresh basil leaves on top of cheese. \n6. Drizzle olive oil over pizza. \n7. Bake for 10-12 minutes, until crust is golden brown and cheese is melted and bubbly.",
      "rating": 4.9,
      "image_link": "https://images-gmi-pmc.edge-generalmills.com/b4fadd7f-64df-40d0-9ab2-bd9d5581a982.jpg"
    },
    {
      
      "recipe_name": "Lasagna",
      "ingredients": [
        "1.tomato sauce ",
        "2.lasagna noodles ",
        "3.ricotta cheese ",
        "4.ground beef ",
        "5.mozzarella cheese "
      ],
      "cooking_method": "1. Cook lasagna noodles according to package instructions. \n2. Brown ground beef in a pan, then add tomato sauce and simmer for 10 minutes. \n3. In a separate bowl, mix together ricotta cheese and shredded mozzarella cheese. \n4. Preheat oven to 375°F (190°C). \n5. Layer lasagna noodles, meat sauce, and cheese mixture in a baking dish, ending with a layer of cheese. \n6. Cover with foil and bake for 25 minutes. \n7. Remove foil and bake for an additional 25 minutes, until cheese is golden brown and bubbly.",
      "rating": 4.5,
      "image_link": "https://i.ibb.co/FVY6nt8/food-3.jpg"
    }
  ]